content/blog/python-wheels.org
#+TITLE: What's the deal with Python wheels?
#+DATE: <2021-09-06 Mon>
#+AUTHOR: Thibault Lestang
#+PROPERTY: LANGUAGE en
#+PROPERTY: STATUS draft
#+PROPERTY: TAGS Python Packaging Wheel
#+OPTIONS: toc:nil

Python wheels are at the heart of Python packaging. If you've ever
installed a package with ~pip~ from the Python Packaging Index, there
is a high chance that it downloaded a wheel file.

#+begin_example
$ pip install numpy
Collecting numpy
  Downloading numpy-1.21.2-cp39-cp39-manylinux_2_12_x86_64.manylinux2010_x86_64.whl (15.8 MB)
     |████████████████████████████████| 15.8 MB 65 kB/s
Installing collected packages: numpy
Successfully installed numpy-1.21.2
#+end_example

In the example above the file
~numpy-1.21.2-cp39-cp39-manylinux_2_12_x86_64.manylinux2010_x86_64.whl~
is a Python wheel. It contains everything needed to install NumPy 1.21
on my GNU/Linux 64 bits system install my current Python 3.9
environment. In Python, wheels play the role of what we would call a
package in some other contexts (e.g. ~.rpm~ or ~.deb~ package
installation on GNU/Linux). But in Python parlance the word package is
already taken. In Python we say that wheels are /distribution
packages/.

This walktrhough is divided into two main sections

1. Building a wheel for an example package. This is relevant to
   GNU/Linux, MacOS and Windows.
2. Building wheels for GNU/Linux. In these case a bit more work is
   required in order to ensure wheels are portable across /manylinux/
   distributions.

* Example package

  Let's consider an example package with the following layout.

  

  The example package consists of two main files:
  - A C++ extension module ~src/cpp/ddot.cpp~ named ~example~. This
    extension relies on the ~cblas_ddot~ function from an (external)
    CBLAS library. This module turns into a Python module
    ~ddot.cpython-39-x86_64-linux-gnu.so~ with a runtime (dynamic)
    dependency on a CBLAS library (/e.g./ OpenBLAS).
  - A Python file ~dot_product.py~ that imports the ~ddot~ extension module.

  Package build and installation:
  - The extension module is written using ~pybind11~ which a C++
    library that makes it easy interface Python and C++.
  - I used CMake to manage the build simply because CMake works well
    with pybind11 (and this case is well documented).
  - Overall, the Python package is built with ~scikit-build~ which is
    a extension of ~setuptools~ that makes it easy to use CMake as
    part of the setup process.

* Source distributions

  Let's pretend that we want to share this package with a friend.

  A first option is to put everything in an archive:
  #+begin_src shell
	tar -cf septembrse-0.0.0.tar.gz \
	    pyproject.toml \
	    setup.py \
	    CMakeLists.txt \
	    pybind11 \
	    src
  #+end_src

  This is actualy better done automatically using the ~setuptools~ package.
  #+begin_src shell
    python setup.py sdist
  #+end_src

  This creates a ~source distribution~, that contains all the files
  necessary to build and install the package. It also embarks some
  metadata (~PKG-INFO~). Lots of formats available:

  #+begin_src shell :results output
    python setup.py sdist --help-formats
  #+end_src

  #+RESULTS:
  : List of available source distribution formats:
  :   --formats=bztar  bzip2'ed tar-file
  :   --formats=gztar  gzip'ed tar-file
  :   --formats=tar    uncompressed tar file
  :   --formats=xztar  xz'ed tar-file
  :   --formats=zip    ZIP file
  :   --formats=ztar   compressed tar file
  

  Easy enough. We bundled our package's sources into a archive and now
  we can share it with our friend so they can install with ~pip~ in the
  same way.

  #+begin_src shell
    pip install dist/septembrse-0.0.0.tar.gz
  #+end_src

  This unpack the archive and runs the ~setup.py~ script. It
  1. Installs the build tools (~setuptools~, ~cmake~, ~scikit-build~)
  2. Writes metadata
  3. Compiles the extension module
  4. Bundles everything together and copies it to the right
     install location (likely the local /site-packages/ directory).

  Let's see what happens on our friend's machine:

  #+begin_example
    friend@machine:~$ pip install dist/septembrse-0.0.0.tar.gz
    Processing ./dist/septembrse-0.0.0.tar.gz
      ERROR: Command errored out with exit status 1:
      ...
      Complete output (127 lines):
      ... 
      -- Could NOT find BLAS (missing: BLAS_LIBRARIES)
      -- Configuring done
      CMake Error: The following variables are used in this project, but they are set to NOTFOUND.
  #+end_example

  The package cannot be installed since our freind don't have a BLAS
  library installed! After some time looking things up, they firgure
  out that they can
  
  #+begin_src shell
    apt install libopenblas-dev
  #+end_src

  and things run fine.

  
  A ~sdist~ is an archive containing the sources of your package. If
  you give an ~sdist~ to someone, you expect them to be able to
  /build/ the package from scratch. This means meeting all the
  requirements to run the ~setup.py~ script and compiling any
  extension modules.

  In some cases (like the one above), users may get get away with
  installing a package from their system's package manager. Fine. But
  in general, this is a real problem:

  - If there are many dependencies, users have to install them all. Tedious.
  - This is assuming that all these dependencies their is a package
    ready in the system's package repository. Otherwise they will have
    to build the dependency themselves. Tedious, potentially
    technically challenging, and time consuming.
  - This is also assuming that the /right version/ of the dependency
    is packaged. This is especially a problem on GNU/Linux, since
    different distributions package different versions of software. If
    the extension module for our package with linked against version
    ~x~ of a dependency, it's not garanteed to work with version
    ~y~. Frustrating.



  On top of this, remember that when installing a package from a
  ~sdist~, the ~setup.py~ script is executed. This script can actually
  contain any valid Python in addition to the call to
  ~setuptools.setup()~. This means anyone installing a source
  distribution with superuser privileges should feel a bit
  uncomfortable.

