drafts/python-wheels.html
<!DOCTYPE html>
<html lang="en">
    <head>
  	<title>Thibault Lestang - What's the deal with Python wheels?</title>
	<meta charset="utf-8" />
	<link rel="stylesheet" href="/theme/css/rdark.css"/>
	<link rel="stylesheet" type="text/css" href="/theme/css/main.css"/>
	<link rel="stylesheet" type="text/css" href="/theme/css/org-htmlize.css"/>
	<link rel="stylesheet" type="text/css" href="/theme/css/code-blocks.css"/>




    <meta name="tags" content="Python Packaging Wheel" />

    </head>
    <body id="index" class="home">
	<header id="banner" class="body">
            <a href="/">
		Thibault Lestang
	    </a>
	    <nav id="menu"><ul>
		<li>
		    <a href="/">About</a>
		</li>
		<li>
		    <a href="/pages/projects.html">Projects</a>
		</li>
		<li>
		    <a href="/blog">Blog</a>
		</li>
            </ul></nav><!-- /#menu -->
	</header><!-- /#banner -->
<section id="content" class="body">
  <header>
    <h2 class="entry-title">
      <a href="/drafts/python-wheels.html" rel="bookmark"
         title="Permalink to What's the deal with Python wheels?">What's the deal with Python wheels?</a></h2>
 
  </header>
  <footer class="post-info">
    <time class="published" datetime="2021-09-06T00:00:00+01:00">
      Mon 06 September 2021
    </time>
    <address class="vcard author">
      By           <a class="url fn" href="/author/thibault-lestang.html">Thibault Lestang</a>
    </address>
    <div class="category">
        Category: <a href="/category/blog.html">blog</a>
    </div>
    <div class="tags">
        Tags:
            <a href="/tag/python-packaging-wheel.html">Python Packaging Wheel</a>
    </div>
  </footer><!-- /.post-info -->
  <div class="entry-content">
    <p>
Python wheels are at the heart of Python packaging. If you've ever
installed a package with <code>pip</code> from the Python Packaging Index, there
is a high chance that it downloaded a wheel file.
</p>

<pre class="example" id="orgd1c91f0">
$ pip install numpy
Collecting numpy
  Downloading numpy-1.21.2-cp39-cp39-manylinux_2_12_x86_64.manylinux2010_x86_64.whl (15.8 MB)
     |████████████████████████████████| 15.8 MB 65 kB/s
Installing collected packages: numpy
Successfully installed numpy-1.21.2
</pre>

<p>
In the example above the file
<code>numpy-1.21.2-cp39-cp39-manylinux_2_12_x86_64.manylinux2010_x86_64.whl</code>
is a Python wheel. It contains everything needed to install NumPy 1.21
on my GNU/Linux 64 bits system install my current Python 3.9
environment. In Python, wheels play the role of what we would call a
package in some other contexts (e.g. <code>.rpm</code> or <code>.deb</code> package
installation on GNU/Linux). But in Python parlance the word package is
already taken. In Python we say that wheels are <i>distribution
packages</i>.
</p>

<p>
This walktrhough is divided into two main sections
</p>

<ol class="org-ol">
<li>Building a wheel for an example package. This is relevant to
GNU/Linux, MacOS and Windows.</li>
<li>Building wheels for GNU/Linux. In these case a bit more work is
required in order to ensure wheels are portable across <i>manylinux</i>
distributions.</li>
</ol>

<div id="outline-container-org06ba0f4" class="outline-2">
<h2 id="org06ba0f4"><span class="section-number-2">1.</span> Example package</h2>
<div class="outline-text-2" id="text-1">
<p>
Let's consider an example package with the following layout.
</p>



<p>
The example package consists of two main files:
</p>
<ul class="org-ul">
<li>A C++ extension module <code>src/cpp/ddot.cpp</code> named <code>example</code>. This
extension relies on the <code>cblas_ddot</code> function from an (external)
CBLAS library. This module turns into a Python module
<code>ddot.cpython-39-x86_64-linux-gnu.so</code> with a runtime (dynamic)
dependency on a CBLAS library (<i>e.g.</i> OpenBLAS).</li>
<li>A Python file <code>dot_product.py</code> that imports the <code>ddot</code> extension module.</li>
</ul>

<p>
Package build and installation:
</p>
<ul class="org-ul">
<li>The extension module is written using <code>pybind11</code> which a C++
library that makes it easy interface Python and C++.</li>
<li>I used CMake to manage the build simply because CMake works well
with pybind11 (and this case is well documented).</li>
<li>Overall, the Python package is built with <code>scikit-build</code> which is
a extension of <code>setuptools</code> that makes it easy to use CMake as
part of the setup process.</li>
</ul>
</div>
</div>

<div id="outline-container-org0398516" class="outline-2">
<h2 id="org0398516"><span class="section-number-2">2.</span> Source distributions</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's pretend that we want to share this package with a friend.
</p>

<p>
A first option is to put everything in an archive:
</p>
<div class="org-src-container">
<pre class="src src-shell">tar -cf septembrse-0.0.0.tar.gz <span class="org-sh-escaped-newline">\</span>
    pyproject.toml <span class="org-sh-escaped-newline">\</span>
    setup.py <span class="org-sh-escaped-newline">\</span>
    CMakeLists.txt <span class="org-sh-escaped-newline">\</span>
    pybind11 <span class="org-sh-escaped-newline">\</span>
    src
</pre>
</div>

<p>
This is actualy better done automatically using the <code>setuptools</code> package.
</p>
<div class="org-src-container">
<pre class="src src-shell">python setup.py sdist
</pre>
</div>

<p>
This creates a <code>source distribution</code>, that contains all the files
necessary to build and install the package. It also embarks some
metadata (<code>PKG-INFO</code>). Lots of formats available:
</p>

<div class="org-src-container">
<pre class="src src-shell">python setup.py sdist --help-formats
</pre>
</div>


<p>
Easy enough. We bundled our package's sources into a archive and now
we can share it with our friend so they can install with <code>pip</code> in the
same way.
</p>

<div class="org-src-container">
<pre class="src src-shell">pip install dist/septembrse-0.0.0.tar.gz
</pre>
</div>

<p>
This unpack the archive and runs the <code>setup.py</code> script. It
</p>
<ol class="org-ol">
<li>Installs the build tools (<code>setuptools</code>, <code>cmake</code>, <code>scikit-build</code>)</li>
<li>Writes metadata</li>
<li>Compiles the extension module</li>
<li>Bundles everything together and copies it to the right
install location (likely the local <i>site-packages</i> directory).</li>
</ol>

<p>
Let's see what happens on our friend's machine:
</p>

<pre class="example" id="org01dbbc5">
friend@machine:~$ pip install dist/septembrse-0.0.0.tar.gz
Processing ./dist/septembrse-0.0.0.tar.gz
  ERROR: Command errored out with exit status 1:
  ...
  Complete output (127 lines):
  ... 
  -- Could NOT find BLAS (missing: BLAS_LIBRARIES)
  -- Configuring done
  CMake Error: The following variables are used in this project, but they are set to NOTFOUND.
</pre>

<p>
The package cannot be installed since our freind don't have a BLAS
library installed! After some time looking things up, they firgure
out that they can
</p>

<div class="org-src-container">
<pre class="src src-shell">apt install libopenblas-dev
</pre>
</div>

<p>
and things run fine.
</p>


<p>
A <code>sdist</code> is an archive containing the sources of your package. If
you give an <code>sdist</code> to someone, you expect them to be able to
<i>build</i> the package from scratch. This means meeting all the
requirements to run the <code>setup.py</code> script and compiling any
extension modules.
</p>

<p>
In some cases (like the one above), users may get get away with
installing a package from their system's package manager. Fine. But
in general, this is a real problem:
</p>

<ul class="org-ul">
<li>If there are many dependencies, users have to install them all. Tedious.</li>
<li>This is assuming that all these dependencies their is a package
ready in the system's package repository. Otherwise they will have
to build the dependency themselves. Tedious, potentially
technically challenging, and time consuming.</li>
<li>This is also assuming that the <i>right version</i> of the dependency
is packaged. This is especially a problem on GNU/Linux, since
different distributions package different versions of software. If
the extension module for our package with linked against version
<code>x</code> of a dependency, it's not garanteed to work with version
<code>y</code>. Frustrating.</li>
</ul>



<p>
On top of this, remember that when installing a package from a
<code>sdist</code>, the <code>setup.py</code> script is executed. This script can actually
contain any valid Python in addition to the call to
<code>setuptools.setup()</code>. This means anyone installing a source
distribution with superuser privileges should feel a bit
uncomfortable.
</p>
</div>
</div>
