content/blog/python-wheels.org
* Building a wheel distribution

  What if we gave our friend an archive, but containing an /built/
  version of our package? In this case ~pip~'s only job would be to
  extract the files and copy them in the right place on out friend's computer.

  That's precisely the idea behind Python wheels, and more generally
  behing /built distributions/ (as opposed to /source distributions/).

  A wheel is built using ~setuptools~ with the ~wheel~ package.

  #+begin_src shell
    python setup.py bdist_wheel
  #+end_src

  Let's look at what is happening under the hood.

  1. We start with some CMake output. The C++ extension module
     ~example~ is compiled.

     #+begin_example
       -- Build files have been written to: /home/thibault/repos/septembrse_example/_skbuild/linux-x86_64-3.9/cmake-build
       [ 50%] Building CXX object CMakeFiles/example.dir/src/cpp/ddot.cpp.o
       [100%] Linking CXX shared module example.cpython-39-x86_64-linux-gnu.so
       [100%] Built target example
     #+end_example

   2. Then there is a succesion of creating temporary directories and
	copying files around. Ultimately, both the the Python source
	files and the compiled extension are copied into the ~wheel/~
	directory.

   3. The third step is writing some metadata about the package itself
      and its build. So far this is exactly what happens when you
      install a Python package. Except this time it is install into
      this temporary ~wheel/~ directory instead of your local package
      directory.

   4. The final step is taking the content of that ~wheel~ direcotry
      and putting its content into a zip archive. The ~wheel~
      directory is removed.

  What we learn from this is that a wheel distribution is a zip
  archive that contains the installed form of a Python package.
  #+begin_example
    unzip -l dist/septembrse-0.0.0-cp39-cp39-linux_x86_64.whl
    Archive:  dist/septembrse-0.0.0-cp39-cp39-linux_x86_64.whl
      Length      Date    Time    Name
    ---------  ---------- -----   ----
	   15  2021-09-04 09:02   example_pkg/__init__.py
	93400  2021-09-04 09:02   example_pkg/example.cpython-39-x86_64-linux-gnu.so
	  241  2021-09-04 09:02   septembrse-0.0.0.dist-info/METADATA
	   97  2021-09-04 09:02   septembrse-0.0.0.dist-info/WHEEL
	   12  2021-09-04 09:02   septembrse-0.0.0.dist-info/top_level.txt
	  495  2021-09-04 09:02   septembrse-0.0.0.dist-info/RECORD
    ---------                     -------
	94260                     6 files

  #+end_example

  Now when you install this wheel, all ~pip~ has to do is copy the
  files into your local package directory. It doesn't have to run the
  ~setup.py~ script - all the hard work is already done. Notice that
  the ~setup.py~ script isn't even contained inside the wheel.

  The immediate benefit of this is that I can now share my package
  with my friends, and they don't have to worry about building it.
  They don't have to worry about setuptools, scikit-build, CMake,
  OpenBLAS. They just ~pip install~ and use the package. Its also a
  smaller file to share.


  The downside is that - if my wheel contains compiled code - it is
  platform and python version specific. If its purely Python, I can
  share it with the world and don't worry about portability. If it's
  not, then I'm going to have to build the wheel for each plaftform,
  for each python version I want to support.


