drafts/python-wheels.html

<div id="outline-container-orgc040e42" class="outline-2">
<h2 id="orgc040e42"><span class="section-number-2">3.</span> Building a wheel distribution</h2>
<div class="outline-text-2" id="text-3">
<p>
What if we gave our friend an archive, but containing an <i>built</i>
version of our package? In this case <code>pip</code>'s only job would be to
extract the files and copy them in the right place on out friend's computer.
</p>

<p>
That's precisely the idea behind Python wheels, and more generally
behing <i>built distributions</i> (as opposed to <i>source distributions</i>).
</p>

<p>
A wheel is built using <code>setuptools</code> with the <code>wheel</code> package.
</p>

<div class="org-src-container">
<pre class="src src-shell">python setup.py bdist_wheel
</pre>
</div>

<p>
Let's look at what is happening under the hood.
</p>

<ol class="org-ol">
<li><p>
We start with some CMake output. The C++ extension module
<code>example</code> is compiled.
</p>

<pre class="example" id="orge6393d2">
-- Build files have been written to: /home/thibault/repos/septembrse_example/_skbuild/linux-x86_64-3.9/cmake-build
[ 50%] Building CXX object CMakeFiles/example.dir/src/cpp/ddot.cpp.o
[100%] Linking CXX shared module example.cpython-39-x86_64-linux-gnu.so
[100%] Built target example
</pre>

<ol class="org-ol">
<li>Then there is a succesion of creating temporary directories and
copying files around. Ultimately, both the the Python source
files and the compiled extension are copied into the <code>wheel/</code>
directory.</li>

<li>The third step is writing some metadata about the package itself
and its build. So far this is exactly what happens when you
install a Python package. Except this time it is install into
this temporary <code>wheel/</code> directory instead of your local package
directory.</li>

<li>The final step is taking the content of that <code>wheel</code> direcotry
and putting its content into a zip archive. The <code>wheel</code>
directory is removed.</li>
</ol></li>
</ol>

<p>
What we learn from this is that a wheel distribution is a zip
archive that contains the installed form of a Python package.
</p>
<pre class="example" id="org8f5a8eb">
unzip -l dist/septembrse-0.0.0-cp39-cp39-linux_x86_64.whl
Archive:  dist/septembrse-0.0.0-cp39-cp39-linux_x86_64.whl
  Length      Date    Time    Name
---------  ---------- -----   ----
       15  2021-09-04 09:02   example_pkg/__init__.py
    93400  2021-09-04 09:02   example_pkg/example.cpython-39-x86_64-linux-gnu.so
      241  2021-09-04 09:02   septembrse-0.0.0.dist-info/METADATA
       97  2021-09-04 09:02   septembrse-0.0.0.dist-info/WHEEL
       12  2021-09-04 09:02   septembrse-0.0.0.dist-info/top_level.txt
      495  2021-09-04 09:02   septembrse-0.0.0.dist-info/RECORD
---------                     -------
    94260                     6 files

</pre>

<p>
Now when you install this wheel, all <code>pip</code> has to do is copy the
files into your local package directory. It doesn't have to run the
<code>setup.py</code> script - all the hard work is already done. Notice that
the <code>setup.py</code> script isn't even contained inside the wheel.
</p>

<p>
The immediate benefit of this is that I can now share my package
with my friends, and they don't have to worry about building it.
They don't have to worry about setuptools, scikit-build, CMake,
OpenBLAS. They just <code>pip install</code> and use the package. Its also a
smaller file to share.
</p>


<p>
The downside is that - if my wheel contains compiled code - it is
platform and python version specific. If its purely Python, I can
share it with the world and don't worry about portability. If it's
not, then I'm going to have to build the wheel for each plaftform,
for each python version I want to support.
</p>
</div>
</div>
