content/blog/python-wheels.org
* manylinux

  Now let's focus on the case of GNU/Linux, for which there is an
  added complication.  On GNU/Linux, virtually every executable or
  shared library has a dynamic dependency on the GNU standard c
  library (/glibc/). This library is responsible for interfacing with
  the Linux kernel. When you run code from a compiled Python
  extension, this extension is expecting to be able to find some
  symbols (constants, functions) in glibc shared library.

  Now, newer glibc versions are not garanteed to work with older ones.
  This is a problem because different GNU/Linux distros come with the
  different versions of /glibc/. If you build your wheel the latest
  Ubuntu, it's unlikely to work on an older distribution with an older
  glibc.

  The opposite, however, is true. It is garanteed that code linked
  against an older version of glibc wilkl work with a newer one.  So
  in order to build portable wheels, that work on /manylinux/
  distributions, we want to be doing so on older systems that ship
  with older versions of glibc.

  All of this is irrelevant if your package is purely Python code.
  But if you do have one or more extension modules, you need to think
  about that.

  As a Python packager, you don't have to find and install an old
  CentOS 5 image in order to build your wheels. There is a group of
  people named the [[https://www.pypa.io/en/latest/][Python Packaging Authority]] who maintains a set of
  docker images you can use to build your wheels inside.

  We don't have to it ourselves. They're is a group of people named
  ]] that take care of maintaining
  projects used in Python packaging (e.g. PyPI). They maintain [[https://github.com/pypa/manylinux#docker-images][a set
  of Docker images]] you can use to buiold your wheels in.

  For instance the ~manylinux2014~ image is based on CentOS 7:

  #+begin_src shell
    docker run -i -t -v `pwd`:/io quay.io/pypa/manylinux2014_x86_64 /bin/bash
  #+end_src

  Manylinux images contain all currently supported Python versions:
  #+begin_src shell
    root@221b30d4d160:/# ls /opt/python
    cp310-cp310  cp36-cp36m  cp37-cp37m  cp38-cp38	cp39-cp39  pp37-pypy37_pp73
  #+end_src

  Let's build our wheel for, say, Python 3.8. First we install
  OpenBLAS (required to build the C++ extension module).
  #+begin_src shell
    apt update && apt install libopenblas-dev
  #+end_src

  We then build the wheel
  #+begin_src shell
    root@221b30d4d160:/# cd /io/
    root@221b30d4d160:/io# /opt/python/cp38-cp38/bin/pip wheel .
  #+end_src

  #+begin_src shell
    root@221b30d4d160:/io# ls -l | grep .whl$
    -rw-r--r-- 1 root root   42127 Sep  3 09:58 septembrse-0.0.0-cp38-cp38-linux_x86_64.whl
  #+end_src

  Are we good yet? Not exactly. Our wheel's platform tag is still
  ~linux_x86_64~ as opposed to something based on ~manylinux~. The
  platform tag is important because when ~pip~ goes to look for wheels
  to install, the platform tag is what is helping it choose the right
  version to download and install.

  The attribution of the ~manylinux~ platform tag is not the job of
  ~pip~, but it is ~auditwheel~'s. This utility scans the wheel and
  decides whether or not it can be attributed a ~manylinux~ tag. If
  yes, it creates a new wheel with the correct name tag.

  Let's first inspect out wheel - this only prints info, doest not
  create a new wheel yet.

  #+begin_example
    [root@e42ba33f35c4 io]# auditwheel show septembrse-0.0.0-cp38-cp38-linux_x86_64.whl

    septembrse-0.0.0-cp38-cp38-linux_x86_64.whl is consistent with the
    following platform tag: "linux_x86_64".

    The wheel references external versioned symbols in these
    system-provided shared libraries: libgcc_s.so.1 with versions
    {'GCC_3.0', 'GCC_3.3', 'GCC_4.2.0', 'GCC_4.3.0', 'GCC_3.3.1'},
    libc.so.6 with versions {'GLIBC_2.3', 'GLIBC_2.3.4', 'GLIBC_2.10',
    'GLIBC_2.14', 'GLIBC_2.4', 'GLIBC_2.2.5', 'GLIBC_2.17'},
    libstdc++.so.6 with versions {'CXXABI_1.3.3', 'GLIBCXX_3.4.18',
    'CXXABI_1.3', 'GLIBCXX_3.4', 'CXXABI_1.3.2', 'CXXABI_1.3.5'},
    libgfortran.so.3 with versions {'GFORTRAN_1.0'}, libm.so.6 with
    versions {'GLIBC_2.2.5'}, libquadmath.so.0 with versions
    {'QUADMATH_1.0'}

    This constrains the platform tag to "manylinux_2_17_x86_64". In order
    to achieve a more compatible tag, you would need to recompile a new
    wheel from source on a system with earlier versions of these
    libraries, such as a recent manylinux image.
  #+end_example

  The important information is that our wheel is valid for the
  platform tag ~manylinux_2_17_x86_64~. This means it is expected to
  work on any GNU/Linux system with a version of glibc equal or above
  2.17. That's expected because the version of glibc in this Docker
  image is 2.17.

  To actually produce the manylinux wheel, we use the  ~auditwheel repair~ command:
  #+begin_src shell
    auditwheel repair septembrse-0.0.0-cp38-cp38-linux_x86_64.whl
  #+end_src

  A new direcoty ~wheelhouse~ was created with out manylinux wheel in it.

