drafts/python-wheels.html


<div id="outline-container-orgaa44ef8" class="outline-2">
<h2 id="orgaa44ef8"><span class="section-number-2">4.</span> manylinux</h2>
<div class="outline-text-2" id="text-4">
<p>
Now let's focus on the case of GNU/Linux, for which there is an
added complication.  On GNU/Linux, virtually every executable or
shared library has a dynamic dependency on the GNU standard c
library (<i>glibc</i>). This library is responsible for interfacing with
the Linux kernel. When you run code from a compiled Python
extension, this extension is expecting to be able to find some
symbols (constants, functions) in glibc shared library.
</p>

<p>
Now, newer glibc versions are not garanteed to work with older ones.
This is a problem because different GNU/Linux distros come with the
different versions of <i>glibc</i>. If you build your wheel the latest
Ubuntu, it's unlikely to work on an older distribution with an older
glibc.
</p>

<p>
The opposite, however, is true. It is garanteed that code linked
against an older version of glibc wilkl work with a newer one.  So
in order to build portable wheels, that work on <i>manylinux</i>
distributions, we want to be doing so on older systems that ship
with older versions of glibc.
</p>

<p>
All of this is irrelevant if your package is purely Python code.
But if you do have one or more extension modules, you need to think
about that.
</p>

<p>
As a Python packager, you don't have to find and install an old
CentOS 5 image in order to build your wheels. There is a group of
people named the <a href="https://www.pypa.io/en/latest/">Python Packaging Authority</a> who maintains a set of
docker images you can use to build your wheels inside.
</p>

<p>
We don't have to it ourselves. They're is a group of people named
]] that take care of maintaining
projects used in Python packaging (e.g. PyPI). They maintain <a href="https://github.com/pypa/manylinux#docker-images">a set
of Docker images</a> you can use to buiold your wheels in.
</p>

<p>
For instance the <code>manylinux2014</code> image is based on CentOS 7:
</p>

<div class="org-src-container">
<pre class="src src-shell">docker run -i -t -v <span class="org-sh-quoted-exec">`pwd`</span>:/io quay.io/pypa/manylinux2014_x86_64 /bin/bash
</pre>
</div>

<p>
Manylinux images contain all currently supported Python versions:
</p>
<div class="org-src-container">
<pre class="src src-shell">root@221b30d4d160:/# ls /opt/python
cp310-cp310  cp36-cp36m  cp37-cp37m  cp38-cp38  cp39-cp39  pp37-pypy37_pp73
</pre>
</div>

<p>
Let's build our wheel for, say, Python 3.8. First we install
OpenBLAS (required to build the C++ extension module).
</p>
<div class="org-src-container">
<pre class="src src-shell">apt update &amp;&amp; apt install libopenblas-dev
</pre>
</div>

<p>
We then build the wheel
</p>
<div class="org-src-container">
<pre class="src src-shell">root@221b30d4d160:/# cd /io/
root@221b30d4d160:/io# /opt/python/cp38-cp38/bin/pip wheel .
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">root@221b30d4d160:/io# ls -l | grep .whl$
-rw-r--r-- 1 root root   42127 Sep  3 09:58 septembrse-0.0.0-cp38-cp38-linux_x86_64.whl
</pre>
</div>

<p>
Are we good yet? Not exactly. Our wheel's platform tag is still
<code>linux_x86_64</code> as opposed to something based on <code>manylinux</code>. The
platform tag is important because when <code>pip</code> goes to look for wheels
to install, the platform tag is what is helping it choose the right
version to download and install.
</p>

<p>
The attribution of the <code>manylinux</code> platform tag is not the job of
<code>pip</code>, but it is <code>auditwheel</code>'s. This utility scans the wheel and
decides whether or not it can be attributed a <code>manylinux</code> tag. If
yes, it creates a new wheel with the correct name tag.
</p>

<p>
Let's first inspect out wheel - this only prints info, doest not
create a new wheel yet.
</p>

<pre class="example" id="org04b5892">
[root@e42ba33f35c4 io]# auditwheel show septembrse-0.0.0-cp38-cp38-linux_x86_64.whl

septembrse-0.0.0-cp38-cp38-linux_x86_64.whl is consistent with the
following platform tag: "linux_x86_64".

The wheel references external versioned symbols in these
system-provided shared libraries: libgcc_s.so.1 with versions
{'GCC_3.0', 'GCC_3.3', 'GCC_4.2.0', 'GCC_4.3.0', 'GCC_3.3.1'},
libc.so.6 with versions {'GLIBC_2.3', 'GLIBC_2.3.4', 'GLIBC_2.10',
'GLIBC_2.14', 'GLIBC_2.4', 'GLIBC_2.2.5', 'GLIBC_2.17'},
libstdc++.so.6 with versions {'CXXABI_1.3.3', 'GLIBCXX_3.4.18',
'CXXABI_1.3', 'GLIBCXX_3.4', 'CXXABI_1.3.2', 'CXXABI_1.3.5'},
libgfortran.so.3 with versions {'GFORTRAN_1.0'}, libm.so.6 with
versions {'GLIBC_2.2.5'}, libquadmath.so.0 with versions
{'QUADMATH_1.0'}

This constrains the platform tag to "manylinux_2_17_x86_64". In order
to achieve a more compatible tag, you would need to recompile a new
wheel from source on a system with earlier versions of these
libraries, such as a recent manylinux image.
</pre>

<p>
The important information is that our wheel is valid for the
platform tag <code>manylinux_2_17_x86_64</code>. This means it is expected to
work on any GNU/Linux system with a version of glibc equal or above
2.17. That's expected because the version of glibc in this Docker
image is 2.17.
</p>

<p>
To actually produce the manylinux wheel, we use the  <code>auditwheel repair</code> command:
</p>
<div class="org-src-container">
<pre class="src src-shell">auditwheel repair septembrse-0.0.0-cp38-cp38-linux_x86_64.whl
</pre>
</div>

<p>
A new direcoty <code>wheelhouse</code> was created with out manylinux wheel in it.
</p>
</div>
