content/blog/python-wheels.org
** Runtime dependency on OpenBLAS

   There's is one detail I glossed over.

   Our C extension module has dynamics dependencies to various shared
   libraries.

   #+begin_src shell
     root@221b30d4d160:/io# ldd example_pkg/example.cpython-38-x86_64-linux-gnu.so
	     linux-vdso.so.1 (0x00007ffd2dfed000)
	     libopenblas.so.0 => /usr/lib/libopenblas.so.0 (0x00007ff591260000)
	     libstdc++.so.6 => /usr/lib/x86_64-linux-gnu/libstdc++.so.6 (0x00007ff590ede000)
	     libm.so.6 => /lib/x86_64-linux-gnu/libm.so.6 (0x00007ff590bda000)
	     libgcc_s.so.1 => /lib/x86_64-linux-gnu/libgcc_s.so.1 (0x00007ff5909c3000)
	     libc.so.6 => /lib/x86_64-linux-gnu/libc.so.6 (0x00007ff590624000)
	     libpthread.so.0 => /lib/x86_64-linux-gnu/libpthread.so.0 (0x00007ff590407000)
	     libgfortran.so.3 => /usr/lib/x86_64-linux-gnu/libgfortran.so.3 (0x00007ff5900e1000)
	     /lib64/ld-linux-x86-64.so.2 (0x00007ff5935d1000)
	     libquadmath.so.0 => /usr/lib/x86_64-linux-gnu/libquadmath.so.0 (0x00007ff58fea2000)
   #+end_src

   Most of these dependencies are libraries that we would expect to be
   present on most GNU/Linux systems out there. But this is not the
   case of ~libopenblas~ - which we installed manually as a build-time
   dependency inside the /manylinux/ Docker image. In the current
   state of things, a user could install the wheel fine, but at the
   moment they would import the package it would break: ~libopenblas
   not found~!

   The solution to this is simple: let's add ~libopenblas~ to the
   wheel (remember, a wheel is nothing else than an archive). This is,
   however, not enough. We also need to make sure that, at runtime,
   the system knows where to look to find this shared library. This
   can be done by modyfing the ~DT_RUNPATH~ list of directories in the
   extension module shared library. This is rather technical and
   error-prone, but ~auditwheel repair~ does the work for us. Prior to
   creating the new /manylinux/ wheel, this command
   1. Scans the dynamics dependencies for the wheel's extension
      module(s)s and identifies those that are outside of a very
      restricited set of shared libraries usually distributed by most
      GNU/Linux distributions.
   2. Copies the corresponding shared libraries (~.so~ file) into the
      wheel.
   3. Modifies the ~DT_RUNPATH~ (or ~DT_RPATH~) entry for the compiled
      extension module(s) so that the dynamic linker finds these
      shares libraries at runtime.

   If use ~ldd~ on the ~example~ extension inside the manylinux wheel
   this time, we see that a few shared libraries are now found inside
   the wheel itself.

   We now have a self-contained wheel that is usable across many linux
   distributions.

   I want to point out that this runtime dependency issue isn't
   restricted to building wheels on GNU/Linux systems. On MacOS,
   [[https://github.com/matthew-brett/delocate][delocate]] does a job similar to ~auditwheel~. On Windows, I haven't
   found a way to embed dynamic dependecnies (~dll~ files) inside
   ~win32~ or ~win64~ wheels. An alternative is to link these
   dependencies statically.

* Conclusion

  That's all I wanted to show you today. If you're currently working
  on a Python project or plan to do so, then I really encourage you to
  dig a bit deeper into the topic. The material for this walthrough is
  available online, along with a list of references for further
  reading. I also encourage you distribute wheels for your projects,
  it will make it much easier to use your package. Building wheels is
  a relatively complex process for computers, but for us packagers not
  so much. That is thanks to the work of the PyPA who maintain
  manylinux and auditwheel, the contributors behing delocate and
  cibuildwheel. So let's thank them and happy wheel building!
